Tekla Open API Reference for Tekla Structures 2025
Part Constructor
 Initializes a new instance of the Part class with default attributes.
The default values are set as follows:
Position = new Position();
Profile = new Profile();
Material = new Material();
DeformingData = new DeformingData();
Name = "";
Class = "";
Finish = "";
PartNumber = new NumberingSeries("P", 1);
AssemblyNumber = new NumberingSeries("A", 1);
CastUnitType = CastUnitTypeEnum.PRECAST;
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Part()
Public Sub New
See Also
Reference
Part Class
Tekla.Structures.Model Namespace